CREATE DATA FRAME

In [2]:
import pandas as pd
d={'Name':['Priyang','Aadhya','Krishna','Vedant','Prashav','Mittal','Archana'],
   'Marks':[98,89,99,87,90,83,99],
   'Gender':['Male','Female','Female','Male','Male','Female','Female']}
df=pd.DataFrame(d)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1.DISPLAY TOP 3 ROWS OF DATASETS:

In [4]:
df=df.head(3)
print(df)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

2.CHECK LAST 3 ROWS OF DATASETS:

In [10]:
df.tail(3)

      Name  Marks  Gender
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3.FIND THE SHAPE OF THE DATASET(NO OF ROWS & NO OF COLUMNS)

In [13]:
print(df.shape)

(7, 3)

In [14]:
print('No of rows',df.shape[0])
print('No of columns',df.shape[1])

No of rows 7
No of columns 3

4.GET INFO ABOUT DATA SET LIKE TOTAL NO OF ROWS,COLUMNS,DATATYPES OF EACH COLUMN AND MEMORY REQURIMENT

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5.CHECK NULL VALUES IN THE DATASET

In [17]:
df.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

6.GET OVER ALL STATISTICS ABOUT DATA FRAME

In [18]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

7.FIND THE UNIQUE VALUES FORM THE GENDER COLUMN

In [20]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

8.FIND THE NO OF UNIQUE VALUES FROM THE GENDER COLUMN

In [21]:
df['Gender'].nunique()

2

9.DISPLAY THE COUNT OF UNIQUE VALUES IN GENDER COLUMN

In [22]:
df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

10.FIND THE TOTAL NO OF STUDENTS HAVING MARKS BETWEEN 90 TO 100 USING BETWEEN METHOD

In [32]:
import pandas as pd

d={'Name':['Priyang','Aadhya','Krishna','Vedant','Prashav','Mittal','Archana'],
   'Marks':[98,89,99,87,90,83,99],
   'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df=pd.DataFrame(d)   # recreate DataFrame
print(df)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [33]:
mask=df['Marks'].between(90,100)
print(mask)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [ ]:
print(mask.sum())# total count

4

In [36]:
student=df[mask]
print(student)#get all students with marks between 90 and 100

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4  Prashav     90    Male
6  Archana     99  Female

11.FIND AVERAGE MARKS

In [38]:
df['Marks'].mean()

np.float64(92.14285714285714)

12.FIND MIN MARKS

In [40]:
df['Marks'].min()

np.int64(83)

13.FIND MAX MARKS

In [42]:
df['Marks'].max()

np.int64(99)

14.DROP THE COLUMNS

In [2]:
import pandas as pd

d={'Name':['Priyang','Aadhya','Krishna','Vedant','Prashav','Mittal','Archana'],
   'Marks':[98,89,99,87,90,83,99],
   'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df=pd.DataFrame(d)   # recreate DataFrame
print(df)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df.drop('Gender',axis=1)#drop only 1 column row-wise axis=1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2  Krishna     99
3   Vedant     87
4  Prashav     90
5   Mittal     83
6  Archana     99

In [7]:
df.drop(['Name','Marks'],axis=1)# to drop multiple columns

   Gender
0    Male
1  Female
2  Female
3    Male
4    Male
5  Female
6  Female

In [8]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [ ]:
df.drop(['Name','Gender'],axis=1,inplace=True,errors='ignore')#to delete row permanently we use inplace=true,errors=ignore
print(df)

   Marks
0     98
1     89
2     99
3     87
4     90
5     83
6     99

In [13]:
df

   Marks
0     98
1     89
2     99
3     87
4     90
5     83
6     99

15.PRINT NAME OF THE COLUMN

In [14]:
import pandas as pd

d={'Name':['Priyang','Aadhya','Krishna','Vedant','Prashav','Mittal','Archana'],
   'Marks':[98,89,99,87,90,83,99],
   'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df=pd.DataFrame(d)   # recreate DataFrame
print(df)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [ ]:
df.columns# it shows what are the columns in the datasets

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [17]:
df.index # row indexs

RangeIndex(start=0, stop=7, step=1)

16.SHORT DATA FRAME AS FOR THE  MARKS COLUMN

In [ ]:
df # THIS IS THE ACTUAL DATA FRAME

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [ ]:
df.sort_values(by='Marks',ascending=False)# ascending=flase it gives descending order
# only for

      Name  Marks  Gender
2  Krishna     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4  Prashav     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [22]:
df.sort_values(by=['Marks','Gender'],ascending=False)
                    # multiple column for sorting

      Name  Marks  Gender
2  Krishna     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4  Prashav     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

17.DISPLAY NAMES & MARKS OF THE FINAL STUDENTS

In [23]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4  Prashav     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [24]:
df[df['Gender'].isin(['Female'])] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99